[{"articleLiveDate":"2018-03-27T23:00:00Z","articleUpdateDate":null,"articleTitle":"Snow impacts education websites, it's crucial they're ready","articleUrlSlug":"snow-impacts-education-website","articleDescription":"When snow sweeps across the country, the online world for education providers take a pretty big hit. It doesn’t seem obvious at first, why would it?","articleHeroImage":{"sys":{"id":"42ADCZQha2B72OFCAeClCo","type":"Asset","revision":1,"createdAt":"2022-08-16T10:45:09.912Z","updatedAt":"2022-08-16T10:45:09.912Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Photo by Aaron Burden via UnSplash","description":"","file":{"fileName":"aaron-burden-5AiWn2U10cw-unsplash.jpg","contentType":"image\/jpeg","details":{"size":59561,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/42ADCZQha2B72OFCAeClCo\/f631a8516762390341d43bb7326a49e0\/aaron-burden-5AiWn2U10cw-unsplash.jpg"}}},"articleBody":"<h2>When snow sweeps across the country, the online presence of education providers take a pretty huge hit. It doesn&rsquo;t seem obvious at first, I mean, why would it? But snow forecasts means acknowledgement, plan and finally action to ensure the host servers that our education provers rely on are able to handle the approaching hit - so, what is this &ldquo;hit&rdquo;?<\/h2><p>The &ldquo;hit&rdquo;&ndash; a huge spike in site traffic, visitors, page views, and requests.<\/p><p>On 28th&nbsp;February 2018 between 6AM and 7:30AM, just this happened. Snow swept the nation and parents started wondering&nbsp;<em>and wishing<\/em>&nbsp;whether their sons or daughters school would be closed. This means visiting the&nbsp;<a href=\"http:\/\/www.chriswatterston.com\/designer-developer-solutions-and-services\/bespoke-website-designer-solution\" title=\"\">schools website<\/a>&nbsp;&mdash; but not just once, they are on a missions to refresh the page as many time as they need to until the answer is revealed.<\/p><h3><strong>The average day<\/strong><\/h3><p>On the average day, between the hours of 6AM and 7:30AM, a secondary school website takes around 59 page views. This is &lsquo;page views&rsquo; not &lsquo;sessions&rsquo;, so if you visit a websites homepage and then continue to navigate through to another page, that is classed as 2 page views and 1 session.<\/p><p>This may seem a fairly low number of page views, but remember this is not a website that is&nbsp;<a href=\"http:\/\/www.chriswatterston.com\/design-development-solutions-and-services\/shopify-ecommerce-website-designer-solution\" title=\"\">selling through eCommerce<\/a>&nbsp;or providing a regularly used service. A school website&rsquo;s main focus is updating parents and students with information about day-to-day school life, updates and news. With that being said, let&rsquo;s now turn things up&hellip;<\/p><h3><strong>A snow day<\/strong><\/h3><p>This is where things get pretty crazy! If you&rsquo;re not following the weather or news as a web host system administrator for education, snow can seriously catch you off guard. To a point where server failure would almost be guaranteed, with wondering parents being faced with 500 server error pages. Something that obviously CANNOT happen, of all days!<\/p><p>So how crazy do things get? During the course of&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Black_Friday_(shopping)\" title=\"\">Black Friday<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Cyber_Monday\" title=\"\">Cyber Mondays<\/a>, online shops generally see a 100 to 200% increase in traffic. On 28th February, the school websites I host and maintain, saw traffic spikes as high as 15600% and as small as 6000% individually&hellip;. No, that was not a typo. I saw spikes across the board as big as +15600% compared to that of the average traffic expected between the hours of 6AM and 7:30AM, during a normal weeks school day.<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/5715\/2141\/4109\/snow-day-analytics-01.jpg]<\/p><p><em>The above true data shows one secondary schools analytics stats.<\/em><\/p><p>But this didn&rsquo;t happen only on Wednesday 28th&nbsp;February, this also happened to mirror onto 1st&nbsp;and 2nd&nbsp;March 2018. Nothing like being kept alert. And here we are again, 18th&nbsp;March 2018 and the snow is building on a Sunday evening &mdash; time to prep server and expect further spikes.<\/p><hr \/><p><em>Credits: Photo by&nbsp;<\/em><a href=\"https:\/\/unsplash.com\/photos\/LiMP8mmZbLQ\" title=\"\"><em>CBX<\/em><\/a><em>&nbsp;on&nbsp;<\/em><a href=\"https:\/\/unsplash.com\/\" title=\"\"><em>Unsplash<\/em><\/a><\/p>"},{"articleLiveDate":"2018-03-22T23:00:00Z","articleUpdateDate":null,"articleTitle":"An original podcast feature, Command Line Heroes by Red Hat","articleUrlSlug":"there-is-no-cloud-podcast-ft","articleDescription":"Interviewed by Red Hat Software, about my ‘There is no Cloud’ design for their new original podcast Command Line Heroes.","articleHeroImage":{"sys":{"id":"5ifBJSjnTa0l32vsGNt5D7","type":"Asset","revision":5,"createdAt":"2022-08-16T00:22:39.194Z","updatedAt":"2022-08-16T00:27:47.708Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"There is no Cloud Podcast Feature, Command Line Heroes by Red Hay","description":"","file":{"fileName":"cce3aefa53e8d6dd04fbd83212c96454.jpg","contentType":"image\/jpeg","details":{"size":72139,"image":{"width":1707,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/5ifBJSjnTa0l32vsGNt5D7\/b61b79105f412218d0d5fae71c280ca3\/cce3aefa53e8d6dd04fbd83212c96454.jpg"}}},"articleBody":"<h2>I&rsquo;m interviewed by Red Hat Software, about my &lsquo;There is no Cloud&rsquo; design for their new original podcast Command Line Heroes.  A podcast with stories about the people who transform technology from the command line up.<\/h2><h4>EPISODE 6<\/h4><h3>Crack the Cloud_Open<\/h3><p>&quot;There is no cloud. It&#039;s just someone else&#039;s computer.&quot; Or server, to be exact. Big cloud providers offer a relatively easy way to scale out workloads. But what&#039;s the real cost?<\/p><p>In this episode, we talk about the battle in the clouds, where any winner is still very much up in the air.&nbsp;<a href=\"https:\/\/twitter.com\/majorhayden\" title=\"\">Major Hayden<\/a>, Microsoft&#039;s&nbsp;<a href=\"https:\/\/twitter.com\/bridgetkromhout\" title=\"\">Bridget Kromhout<\/a>, and others help us understand the storm that&#039;s brewing and where that leaves open source developers.<\/p><p><a href=\"https:\/\/www.redhat.com\/en\/command-line-heroes\/crack-the-cloud-open\" title=\"\">Listen Now - Episode 6<\/a><\/p><p>Also available to listen and subscribe on;&nbsp;<a href=\"https:\/\/itunes.apple.com\/us\/podcast\/command-line-heroes\/id1319947289?mt=2\" title=\"\">Apple Podcasts<\/a>,&nbsp;<a href=\"https:\/\/open.spotify.com\/show\/4Jgtgr4mHXNDyLldHkfEMz\" title=\"\">Spotify<\/a>&nbsp;&amp;&nbsp;<a href=\"https:\/\/castbox.fm\/channel\/id1105224\" title=\"\">Castbox<\/a><\/p><h4>PRESENTED BY RED HAT<\/h4><p>For 25 years,&nbsp;<a href=\"https:\/\/www.redhat.com\/en\" title=\"\">Red Hat<\/a>&nbsp;has been bringing open source technologies to the enterprise. From the operating system to containers, we believe in building better technology together&mdash;and celebrating the unsung heroes who are remaking our world from the command line up.<\/p>"},{"articleLiveDate":"2018-03-01T23:00:00Z","articleUpdateDate":null,"articleTitle":"Azure Web Apps vs. VM? Consider this for your hosting setup","articleUrlSlug":"azure-web-app-vs-vm-hosting","articleDescription":"I'll focus on two hosting solutions provided by Microsoft Azure, and why using the Web App for your hosting may not be the best solution available.","articleHeroImage":{"sys":{"id":"2dkT46RgavLZsurG3ICSTu","type":"Asset","revision":2,"createdAt":"2022-08-16T11:11:28.397Z","updatedAt":"2022-08-16T11:14:42.412Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Photo by Compare Fibre, via UnSplash","description":"","file":{"fileName":"compare-fibre-tiSE_paTt0A-unsplash.jpg","contentType":"image\/jpeg","details":{"size":117522,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/2dkT46RgavLZsurG3ICSTu\/5bb97aff70ba4decfe323500ca41cb10\/compare-fibre-tiSE_paTt0A-unsplash.jpg"}}},"articleBody":"<h2>I&rsquo;ve had hands-on experience with Microsoft&rsquo;s Azure cloud compute services for quite some time, using services such as the Virtual Networks (vNet), Virtual Machines (VM), Insights, Storage Accounts, Network Security Groups (NSG), Recovery Service Vaults, App Services and so on, all used to build and maintain solutions for both client and personal needs. Within this post, I&rsquo;m going to focus on two particular hosting solutions provided within the Microsoft Azure and why using the App Services for your hosting may not be the best available solution &mdash; instead, possibly consider spinning up a Virtual Machine (VM). Let&rsquo;s find out why?<\/h2><p>On paper, the&nbsp;<a href=\"https:\/\/azure.microsoft.com\/en-gb\/services\/app-service\/\" title=\"\">Microsoft Azure App Service<\/a>&nbsp;looks great and seems the most viable solution. The service has been built and configured to enable you to create and deploy powerful cloud apps using a fully managed platform. You won&rsquo;t need to worry about installing .NET, .NET Core, Java, Ruby, Node.js, PHP or Python. It&rsquo;s all been done for you, and can be enabled with a click of a button.&nbsp;<em>I&rsquo;m really selling this to you aren&rsquo;t I?<\/em><\/p><h3><strong>The Beginning<\/strong><\/h3><p>When first getting started with the Azure App Service, everything ran as one would expect. I was excited, apps were easy to set-up, quick to deploy. Things ran smoothly without a hick-up for months. This was effortless and worry free, what a solution. Or was it.<\/p><p>I started to set-up the Azure App Service for clients of all sizes, because I thought it was fantastic. But as time passed, I started to notice small random outages on a number of the clients App Services, which I have monitored and managed 24\/7, 365 days a year. I acknowledged these outages, but before I could jump onto Azure to look into resolving them, the apps would come back online. After a few week of researching the events, I noticed that the outages started to have an &lsquo;off-peak hours&rsquo; pattern and would never fail during the day. So for that reason I acknowledged but turned a blind eye, assuming that the outages were caused by Microsoft&rsquo;s internal maintenance and would soon be a thing of the past.<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/3715\/1998\/6028\/azure-app-service-outages.jpg]<\/p><p><em>Showing past 6 months uptime\/outages of apps running via&nbsp;<\/em><strong><em>App Service<\/em><\/strong><\/p><blockquote><p>For monitoring platforms I use&nbsp;<a href=\"https:\/\/www.pingdom.com\/\" title=\"\">Pingdom<\/a>. With a network of 60+ probe servers, Pingdom tests are available from all over the world, as often as every minute. And if there is an outage, Pingdom can alert you within milliseconds, ensuring you&rsquo;re the first to know via SMS, Email or via the Pingdom App.<\/p><\/blockquote><p>[http:\/\/www.chriswatterston.com\/application\/files\/7815\/1998\/6026\/azure-virtual-machine-outages.jpg]<\/p><p><em>Showing past 6 months uptime\/outages of apps running via&nbsp;<\/em><strong><em>Virtual Machine<\/em><\/strong><\/p><p>Outages started occurring about twice a month, then increasing to once a week, finally growing to become a very concerning issue by stepping up to multiple outages throughout every evening and night. I couldn&rsquo;t ignore this, and the outages were happening for longer periods showing an error of &ldquo;The page cannot be displayed because an internal server error has occurred&rdquo; when trying to load the page within browsers. From a hosting service which is costing my clients &pound;60+ a month is (NOT including the additional costs of Scale-Out&rsquo;s), without doubt, not standard. In fact, this was more&nbsp;<em>unreliable<\/em>&nbsp;than a hosting package which could cost as little as &pound;4 a month. I&rsquo;ve done my fair rounds with hosting providers over the years, so I know.<\/p><h3><strong>Find the cause<\/strong><\/h3><p>Working towards resolving the never-ending growing issues with the App Services, I needed to resolve these outages. And the only way was to report them to the Microsoft Azure support team. I was asked to enable logging in the hope that this would capture what the cause of the outages. But it didn&rsquo;t, in fact it didn&rsquo;t pick up anything which I found hard to believe. All we found was a few PHP errors, pages not found or stale sessions &mdash; nothing out of the ordinary and nothing relating to the internal server error browser notice that was being shown. I was receiving endless App Service outages throughout the evenings and nights, on multiple separate subscriptions, with&nbsp;<a href=\"https:\/\/web.archive.org\/web\/20200203061748\/https:\/\/azure.microsoft.com\/en-gb\/status\/\" title=\"\">no regional Health Issues showing<\/a>&nbsp;and Microsoft support engineers saying that the outages are caused by &quot;storage migrations&rdquo; - I&rsquo;ll let you evaluate in your head what my thoughts of that were.<\/p><p>Outages continued, &ldquo;PING&rdquo;&hellip; &ldquo;PING&rdquo;&hellip; &ldquo;PING&rdquo;&hellip; &ldquo;PING&rdquo;&hellip; &ldquo;PING&rdquo;&hellip; every evening and night. Which I don&rsquo;t like to admit, really pisses me off!<\/p><p>The hunt continues&hellip;<\/p><h3><strong>Why a Virtual Machine<\/strong><\/h3><p>When a managed service is being offered, it needs to be stable and reliable. Clients shouldn&rsquo;t feel helpless and completely out of control, which is exactly how I felt every time the App Service fails. When an App Service goes offline, or unresponsive, as it had been, you are helpless with no access at host level or even force a reboot. Probably because you don&rsquo;t have an accessible &ldquo;host&rdquo; with App Services. The ONLY option you have, is to submit a support call to Microsoft (if you have a&nbsp;<a href=\"https:\/\/azure.microsoft.com\/en-gb\/support\/options\/\" title=\"\">support SLA<\/a>&nbsp;in place).<\/p><p>Which leads me onto why I would recommend anyone weighting up the options of the App Service vs. Virtual Machine. Comparing the pros and cons between these two options, I can&rsquo;t help but feel the only con for the Virtual Machine would be that you&rsquo;ll need basic Ubuntu (unless you choose Windows, of course) terminal experience to build and configure your host. But even then, you could hire an expert to do this for you. At the time of my service choice, honestly, I only choose to build a Virtual Machine because the Ubuntu (or Linux) App Services were fresh Beta, and had literally only been announce. At the time, I needed to make a rapid host move from&nbsp;<a href=\"https:\/\/mediatemple.net\/\" title=\"\">Media Temple<\/a>&nbsp;to a London, UK based hosting provider and Azure ticked all the boxes. I also liked and enjoyed that I had free rein over the Virtual Machine. Full control over installs of Apache, PHP, MySQL, storage location, cache, and much more. Plus I had control over tracing errors and failures, I would be able to resolve internal server errors myself. Something I can&rsquo;t do with the App Service. Uptime and response rates have also proven considerably better via Virtual Machine hosting, than that of the App Services*.<\/p><p>Rewind time back when I first made the switch to Azure. If I had to make the decision again today, to choice from Virtual Machine or App Service - I wouldn&rsquo;t change and thing.<\/p><h3><strong>The resolution<\/strong><\/h3><p>The outages have not yet been formally resolved, but we are liaising with the Microsoft Azure team to trace and resolve the outages with App Services. I will be sure to provide updates as and when they arise.<\/p><h4><strong>Making your choice or need advice<\/strong><\/h4><p>If you are in the position of making a switch to Azure and need further advise, support, help, or just want to ask some questions, please do leave a comment or send me an email to&nbsp;<a href=\"https:\/\/www.chriswatterston.com\/\" title=\"\">hello@chriswatterston.com<\/a>.<\/p><hr \/><p><strong><em>Disclaimer:&nbsp;<\/em><\/strong><em>The views and opinions expressed in this article are my own and do not necessarily reflect the official policy or position of Microsoft Corporation.<\/em><\/p><p><em>*No significant tests were carried out, I have judged this purely on Pingdom reports.<\/em><\/p>"},{"articleLiveDate":"2018-01-17T23:00:00Z","articleUpdateDate":null,"articleTitle":"Receive web & mobile design project quotations, the easy way","articleUrlSlug":"get-web-mobile-design-quote","articleDescription":"Starting a web or mobile startup projects can be a scary task, some even put the whole thing on hold and never get around to ever achieving it","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2><strong>I&rsquo;m asking you right now to kickstart that project back in motion - do not delay! Starting a web or mobile startup projects can be a scary task, some even put the whole thing on hold and never get around to achieving what they wonted to in life. Ask yourself why, why are you waiting? I enjoy receiving phone calls from inspired people about a new project that they believe in, but sometimes it&rsquo;s easier to send an email instead - which is why I have created you a project proposal and quotation form. Now you have no reason :)<\/strong><\/h2><p>I used to be one of those people that hesitate to pick up the phone and make a phone call. If I had a choice to call or send an email, I&rsquo;d chose email every time. But as technology has evolved, I&rsquo;ve started to turn more towards having that phone conversation over that of email, WhatsApp, Facebook, SMS, Twitter&hellip; and the list goes on. Although, general day-to-day communication is still over email, to keep trailing records. But to ignite the relationship via a phone call, or if possible, the old skool &ldquo;face-to-face&rdquo; is great.<\/p><p>So, without further ado, I&rsquo;d like to introduce you to the a simple project proposal and quotation form that I have created, enabling you to get that ball rolling.<\/p><p><a href=\"http:\/\/www.chriswatterston.com\/getting-started\/project-proposal-and-quotation\" title=\"\">RECEIVE A PROJECT PROPOSAL QUOTE, IT&#039;S YOUR TIME TO SHINE&hellip;<\/a><\/p><p><strong>I&rsquo;m asking you right now to kickstart that project back in motion - do not delay!<\/strong>\n<\/p>"},{"articleLiveDate":"2018-01-09T23:00:00Z","articleUpdateDate":null,"articleTitle":"Launching the official SKOOLping® landing page website","articleUrlSlug":"launching-skoolping-app","articleDescription":"We kicked the SKOOLping landing page ideas and concepts into production","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2><strong>Towards the end of 2017, we kicked the SKOOLping landing page ideas and concepts into production. This involved the creation of the page website design within Photoshop, then reproducing into a functional working website, launching in early 2018. The purpose of the SKOOLping landing page was to clearly put across the direction and vision of SKOOLping. Our vision is to become the leading and most trusted service for education providers to communicate directly with their community.<\/strong><\/h2><p>This early stage of the SKOOLping project took just over two months to; sketch, concept, design, develop and finally move into a launch-able working format. This stage of the project can now be marked as complete and launched, although the landing pages content will continue to develop and grow and things progress with the apps functionality - and as new technologies evolve.<\/p><p>So, without further adieu - please take a loot at the official SKOOLping website.<\/p><p><a href=\"http:\/\/www.skoolping.co.uk\/\" title=\"\">Visit the Official SKOOLping website<\/a><\/p><p><strong>Below is the finalised pre-development design which we produced within Photoshop early November. Included is also an Instagram snap I posted during the website design development. Enjoy :)<\/strong><\/p><p><strong><\/strong><a href=\"https:\/\/www.instagram.com\/p\/Bb2SXuejHp6\/\" title=\"\">View Instagram Post<\/a><\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/7315\/1541\/0431\/design-skoolping-concept.jpg]\n<\/p>"},{"articleLiveDate":"2018-01-04T23:00:00Z","articleUpdateDate":null,"articleTitle":"6 goals for 2018 - Focus, progress and experiment","articleUrlSlug":"2018-goal-setting","articleDescription":"Rolling into a new year, always and naturally means setting new personal and business goals","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2><strong>Rolling into a new year, always and naturally means setting new personal and business goals. 2018 will be a challenge, I know that and I thrive for this. Through 2017, I probably focused more with home life over that of work which definitely had an impact as a whole. As a result, work life had not been as successful as I had hoped for, partly due to frustrating project holdups (which being freelance, we don&rsquo;t get paid for). For 2018, I want to shake the past off and put that behind me. I want to avoid these downfalls and continuously grab and bring new opportunities to life. It&rsquo;s my passion and what I truly enjoy.<\/strong><\/h2><h3><strong>1. Detach Distractions<\/strong><\/h3><p>I want to simplify my life and the things around me. If there are activities going on around me that doesn&rsquo;t require my involvement, then I&rsquo;m staying away. I want to keep a straight and narrow mind set on my goals throughout 2018, which I will remind myself of every day.\n\nWith less distractions and more focus on the areas of work that matter, what I will achieve is going to be very exciting!<\/p><h3><strong>2. Officially Launch SKOOLping&reg;<\/strong><\/h3><p>I aimed to launch my own project during the middle of 2017, but&nbsp;<a href=\"http:\/\/www.chriswatterston.com\/blog\/progress-on-skoolping-and-why-theres-been-a-substantial-delay\" title=\"\">unfortunately during the first few months I became faced with a few hurdles<\/a>&nbsp;- but with collaboration we can now get back to it. The&nbsp;<a href=\"http:\/\/www.skoolping.co.uk\/\" title=\"\">SKOOLping website was designed and developed<\/a>&nbsp;towards the end of 2017, and has recently gone live - but unfortunately (due to the above) our app is still within the development stages.\n\nLearning an in-depth understanding of the programming language &lsquo;<a href=\"https:\/\/swift.org\/\" title=\"\">Swift<\/a>&rsquo; (including&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Cocoa_Touch\" title=\"\">CocoaTouch for iOS<\/a>) was a goal for 2017 and creating this application was to become part that. I&rsquo;ve now moved this huge goal and will reset for 2018. I&rsquo;m also very excited about how I progress and grow with my profession for Swift, and what opportunities this new skill will bring.<\/p><h3><strong>3. New Clients &amp; Contracts (with commute or via remote)<\/strong><\/h3><p>I worked and collaborated with a few new clients throughout 2017, which was fantastic! Now turning things up for 2018 -&nbsp;<a href=\"http:\/\/www.chriswatterston.com\/get-in-contact\" title=\"\">I want to meet, work and collaborate with new clients and organisations<\/a>. Maybe even work alongside a team of talented folk on exciting projects. I want to excel myself and become an essential part of a team, or as a freelance individual.<\/p><h3><strong>4. Network More, Attend Events<\/strong><\/h3><p>When you&rsquo;re working as a freelancer, working within a separate office away from your home, but STILL located within the boundaries of your property, it can get a little too comfortable. This results in not getting out and about in the world, such as commuting to a place of work. This also means that I, yes I&rsquo;ll admit it, didn&rsquo;t make an effort to attend events that I&rsquo;m interested in as much as I wanted to in and around London. I only attended two events in 2017, which were a&nbsp;<a href=\"https:\/\/azure.microsoft.com\/en-gb\/\" title=\"\">Microsoft Azure<\/a>&nbsp;bootcamp and another about UAV Safety and Airspace.\n\nI&rsquo;m getting out there for 2018. I&rsquo;m going to make a keen effort to make sure I attend as many events that relate to my skillset as I can. Whether this are small meetings, or large global based events, I&rsquo;m going to make an effort to be there&hellip; even hanging out online.<\/p><h3><strong>5. Work Towards Certification(s)<\/strong><\/h3><p>Being a freelance full-stack designer, means that it&rsquo;s quite hard to focus and specialise on one particular area. For example; working towards&nbsp;<a href=\"https:\/\/azure.microsoft.com\/en-gb\/\" title=\"\">certification for Microsoft Azure<\/a>. Yes I use Azure daily, but I also use other platforms too, such also&nbsp;<a href=\"https:\/\/cloud.google.com\/\" title=\"\">Google Cloud<\/a>. This means that it&rsquo;s&nbsp;<em>quite hard<\/em>&nbsp;to take the time to study and sit the exams to obtain the certification. Also, what would I gain from having a Microsoft Azure certification against my name? 98% of my clients haven&rsquo;t even heard of Azure. This means there has been no beneficial reason in the past to obtain and take time towards these certifications. My&nbsp;<a href=\"http:\/\/www.chriswatterston.com\/designer-developer-solutions-and-services\" title=\"\">clients pay me to build and provide them with solutions<\/a>, they don&rsquo;t pay me to use a particular platforms.\n\nFor 2018, I&rsquo;m going to make an attempt to obtain as many certification for the platforms I use as I can. I may only get around to achieving one certification, but time will tell.<\/p><h3><strong>6. Explore Artificial Intelligence (AI) &amp; Blockchain Foundation<\/strong><\/h3><p>Finding the time to research deeper into&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Artificial_intelligence\" title=\"\">Artificial Intelligence (AI)<\/a>&nbsp;has been on the &ldquo;To Do&rdquo; list for a few months already, but haven&rsquo;t yet found the time - no surprise there!\n\nThe&nbsp;<a href=\"http:\/\/worldblockchain.foundation\/\" title=\"\">Blockchain Foundation<\/a>&nbsp;is a fairly new one. Reading into it a while back explained how this new technology can change thing for the better and stack history (pun intended). This will defiantly be a much discussed subject for 2018 amongst tech companies and I will be very interested in how the Blockchain is implement into day-to-day things. I may even take advantage of Blockchain in a future project, who knows.<\/p>"},{"articleLiveDate":"2018-01-03T23:00:00Z","articleUpdateDate":null,"articleTitle":"Meltdown and Spectre Vulnerability Update","articleUrlSlug":"meltdown-spectre-update","articleDescription":"Confirmation on your security and protection against Meltdown & Spectre, a CPU flaw from CPU vulnerability that could relate to your hosting infrastructure","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2><strong>Confirmation on your security and protection against Meltdown and Spectre, a CPU flaw from CPU vulnerability, that could relate to your hosting infrastructure<\/strong><\/h2><p>On Wednesday 3rd January 2018, researchers revealed serious flaws in modern processors that could affect practically every Intel computer released in the last two decades,&nbsp;and the AMD and Arm chips in&nbsp;desktops, laptops, tablets and phones - this is pretty BIG!\n\nThought-out Wednesday, it wasn&#039;t all bad news. The good news did&nbsp;come through that&nbsp;<a href=\"https:\/\/www.intel.co.uk\/content\/www\/uk\/en\/homepage.html\" title=\"\">Intel<\/a>,&nbsp;<a href=\"http:\/\/www.amd.com\/en\/home\" title=\"\">AMD<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.arm.com\/\" title=\"\">Arm<\/a>&nbsp;stated that&nbsp;they can fix the vulnerabilities&nbsp;with software patches&nbsp;(There was also some in denial&nbsp;with manufactures, about whether or&nbsp;not this&nbsp;vulnerability actually effected their&nbsp;hardware - but who cares).<\/p><h3>Why does this effect you?<\/h3><p>Not only does this likely effect some of your hardware (which is possibly in your pocket), but this may of also&nbsp;effected your\/our websites hosting&nbsp;infrastructures, which are based within a UK&nbsp;Microsoft datacenter. Microsoft provided us with an update on our underlaying hardware&nbsp;at around midnight last night, highlighting that a majority of the Azure infrastructure had&nbsp;already been updated to address this vulnerability - GREAT NEWS!\n\nAs an extra&nbsp;precaution, I will also be running unscheduled system updates\/patches throughout today to further protect&nbsp;your\/our&nbsp;hosting infrastructures.\n\nIf you have any further questions relating to this update, please email me at&nbsp;<a href=\"mailto:hello@chriswatterston.com?subject=Question%20about%20Meltdown%20and%20Spectre\" title=\"\">hello@chriswatterston.com<\/a>.\n\nThank you for your time.\n<strong>Chris Watterston<\/strong>\n\n\n<em>If you wish to do so, you are able to read the full Microsoft update via,&nbsp;<\/em><a href=\"https:\/\/azure.microsoft.com\/en-us\/blog\/securing-azure-customers-from-cpu-vulnerability\/\" title=\"\"><em>https:\/\/azure.microsoft.com\/en-us\/blog\/securing-azure-customers-from-cpu-vulnerability\/<\/em><\/a><em>.<\/em><\/p>"},{"articleLiveDate":"2017-12-10T23:00:00Z","articleUpdateDate":null,"articleTitle":"2017 Christmas Adverts and their meanings","articleUrlSlug":"2017-christmas-advert-meanings","articleDescription":"The line up for 2017 Christmas adverts are promising, and starting early it seams. I’ve seen some with true meaning, and others with no meaning.","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2>The line up so far for this years Christmas adverts are promising, and starting early it seams. I&rsquo;ve seen some with true meaning, and others with no meaning behind them (apart from the general message of &ldquo;this is what we sell&rdquo;). Without looking into their true meanings, I&rsquo;ll outline what message I get from first impression watching, explained in a nutshell, but not in a long winded way - I won&rsquo;t be getting the nutcracker out just yet (pun intended).<\/h2><h3>BBC One - The Supporting Act<\/h3><p>This is an advert that I can relate to. I have a family that want my attention, but I also have to give attention to my&nbsp;business. Similar to this truly fantastic advert, I work but at the same time also pay attention to what&#039;s happening around me. The hard working&nbsp;single father in this advert works every second of the day, but when the time finally come that he can show his daughter that he does can, it&rsquo;s to late and she storms out the room. The night of the Winter Show finaly comes and she&rsquo;s seen peeking through the curtains looking for her dad, but thinks work has taken priority yet again. But to her surprise, her loving dad is watching. He realises her nerves, puts away his phone and&nbsp;stands up. From the back of the hall, he supports her&nbsp;by showing that he DID pay attention to her every move. This is a very well thought out and stunning advert and defiantly my #1 for the 2017 Christmas Advert lineup.<\/p><p>[youtube-start:8PstSiTCk74:youtube-end]<\/p><h3>M&amp;S - Paddington &amp; The Christmas Visitor<\/h3><p>M&amp;S show the gift of giving when Paddington assists a burglar, that Paddington mistakes for Santa, to deliver&nbsp;all the presents&nbsp;to the the children (that he had really just stolen). After their night together, the burglar takes a turn for the better&nbsp;and realises that the gift of giving is a much warm hearted way.\n\n<a href=\"https:\/\/youtu.be\/KfaSxIkLslE\" title=\"\">Watch the M&amp;S advert<\/a><\/p><h3>John Lewis - #MozTheMonster<\/h3><p>John Lewis are showing that just a little thought into a gift, can be truly beautiful. Like many children, the boy doesn&rsquo;t get much sleep because the &ldquo;monster under the bed&rdquo; keeps him awake during the night. And after time it really starts to show. The monster decides to do the right thing and give&nbsp;a gift of a night light&nbsp;to help the boy sleep at nights - putting his mind at rest about the monster.\n\n<a href=\"https:\/\/youtu.be\/Jw1Y-zhQURU\" title=\"\">Watch the John Lewis advert<\/a><\/p><h3>Asda - Best Christmas Ever<\/h3><p>I&rsquo;m not sure what message I get from Asda&#039;s advert, apart from that their food gets made in a unique Elf factory. It somewhat reminds me of Charlie and the Chocolate Factory. A second watch gives the impressions that maybe they want to show how much dedication they put in the quality of their food?\n\n<a href=\"https:\/\/youtu.be\/Rd9wKCy1pAE\" title=\"\">Watch the Asda advert<\/a>&nbsp;<\/p><h3>Debenhams - #YouShall Find Your Fairytale Christmas (Part 1 &amp; 2)<\/h3><p>This is like watching a series on TV, maybe a Cinderella type cliff hangers. A story line that relates to reality, with social media sharing their story to help find her shoe. Their reunion&nbsp;leaves your heart warm and waiting for your wedding invite - stunning.\n\n<a href=\"https:\/\/youtu.be\/fyNhzFYP3ts\" title=\"\">Watch the Debenhams advert<\/a><\/p><h3>Sainsbury&rsquo;s - #everybitofChristmas<\/h3><p>Sainsbury&rsquo;s theme this years is a catchy one, although I likely won&rsquo;t be learning it this tune. But I&rsquo;m not sure what the message is here - any ideas?\n\n<a href=\"https:\/\/youtu.be\/WU50dLLy7Cw\" title=\"\">Watch the Sainsbury&#039;s advert<\/a><\/p><h3>Tesco - Turkey, Every Which Way<\/h3><p>The title of Tesco&rsquo;s Christmas Advert speaks for itself, and is enough to warm&nbsp;the&nbsp;cockles&nbsp;of one&#039;s heart. Tesco shows that whatever family relation you are; religion, race, culture - you are welcome at Tesco. Everyone is welcome at Christmas and to celebrate.\n\n<a href=\"https:\/\/youtu.be\/qSUkAURUU1I\" title=\"\">Watch the Tesco advert<\/a><\/p><h3>Barbour - The Snowman and The Snowdog<\/h3><p>I&rsquo;ve always been a fan of Barbour, their range shows quality. Watching their advert, they tell a story about a Snowman that gave a little boy a dog for Christmas. Years pass and the little boy turns into an Adult, who turns into a parent, who remembers the his old friend, The Snowman, at this giving time of the year. Christmas morning arrives, and so does the much loved and ever giving Snowman. But this year, the not so little boy&rsquo;s family give&nbsp;back to the Snowman, showing that his gifts were never forgotten - It just happens that this gift is a Barbour waxed coat. Give something worth remembering this Christmas, with quality.\n\n<a href=\"https:\/\/youtu.be\/vkIjXeYBit0\" title=\"\">Watch the Barbour advert<\/a><\/p><h3>Argos - #ReadyForTakeOff<\/h3><p>Argos will pulls out all the stops to ensure delivery of your Christmas. Even if it means side swiping approx 4 meters behind a taking of jet plane, in an open top &ldquo;golf buggy&rdquo;!\n\n<a href=\"https:\/\/youtu.be\/WNqm-sgz86Y\" title=\"\">Watch the Argos advert<\/a><\/p><h3>Aldi - Kevin The Carrot<\/h3><p>Aldi shows this with Kevin&nbsp;the carrot, and his ordeal across an express trains dining table, with an impressive spread. He eventually falls in the arms of his &ldquo;love at first sight&rdquo;, and saves her from peeing herself. Aldi push a message that Christmas is a time for loved ones to come together, and it&#039;s worth peeing yourself for the ones you love - just don&#039;t do it in public!\n\n<a href=\"https:\/\/youtu.be\/iJGpOYKXcSE\" title=\"\">Watch the Aldi advert<\/a>&nbsp;<\/p><h3>Lidl - Mince Pie Maverick<\/h3><p>This advert is directed towards me. I&rsquo;m a bit of a mince pie fan boy, and just watching this makes me weak at the knees - just the thought of a piping hot mince pie with cold cream, oh sh*t! The price seems reasonable for mince pies, too.\n\n<a href=\"https:\/\/youtu.be\/GIn-52yrrPI\" title=\"\">Watch the Lidl advert<\/a><\/p><h3>House of Fraser&nbsp;- Bring Merry Back<\/h3><p>We all have that annoying someone, whether it&rsquo;s around Christmas or just generally every day. House of Fraser shows that we should push that feeling aside (however annoying they are) and bring Merry back with a smile, gift and love all around.\n\n<a href=\"https:\/\/youtu.be\/2PvPqn4dSYc\" title=\"\">Watch the House of Fraser advert<\/a>&nbsp;<\/p><h3>Toys &#039;R&#039; Us - Geoffrey the Part Time Reindeer<\/h3><p>Toys &lsquo;R&rsquo; Us shows that they can provide every gift, and it&#039;s all located under one roof - and it seems that even the reindeers can&rsquo;t resist. Thankfully the long and loyal Geoffery is here to help yet again, from stacking the shelves to pulling Santa around in his sleigh and putting presents down our chimneys.\n\n<a href=\"https:\/\/youtu.be\/B72y_OByf_4\" title=\"\">Watch the Toys &#039;R&#039; Us advert<\/a>&nbsp;<\/p><h3>Currys PC World - Ahmed&rsquo;s Run<\/h3><p>This one brought a smile to my face as it relates to real life events. A Currys PC World employee is trialing products prior to selling them in store, enabling him to understand how and what they can be used for. I thought this was a good one as it had comedy roots, and again has real meaning behind it.\n\n<a href=\"https:\/\/youtu.be\/9kGTIaoyTOc\" title=\"\">Watch the Currys PC World advert<\/a>&nbsp;<\/p><h3>Co-op - Christmas is coming together<\/h3><p>Another heart warning advert about coming together. Similar to that of Tesco, it shows different religions, race and&nbsp;cultures. All coming together and enjoying this time of the year - showing that love really&nbsp;is the greatest gift.\n\n<a href=\"https:\/\/youtu.be\/2CHM9W59slA\" title=\"\">Watch the Co-op advert<\/a>&nbsp;<\/p><p>Have I missed one, or one you think needs to have a place? Comment a link and your thoughts below.<\/p><h4>Have a Merry Christmas &amp;&nbsp;happy new year!<\/h4><p><\/p>"},{"articleLiveDate":"2017-11-22T23:00:00Z","articleUpdateDate":null,"articleTitle":"Create PFX Certs and install SSL Certs on your Azure Web App","articleUrlSlug":"create-pfx-install-ssl-azure","articleDescription":"If you don’t know about SSL, CSR, PFX, CRT, P7B and manage a Cloud Hosting (like Azure), then you may find it confusing when asked to supply a PFX files","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2><strong>If you don&rsquo;t know much about HTTPS, SSL, CSR, PFX, CRT, P7B and manage a Cloud Hosting Infrastructure, such as Azure, then you may find it confusing when asked to supply .pfx files to bind and secure your application. I&rsquo;ve created this tutorial to help, and hopefully answer, questions you may have in relation to this type of process. How to create a .pfx file for Microsoft Azure?<\/strong><\/h2><p>\n<a href=\"https:\/\/azure.microsoft.com\/en-gb\/\" title=\"\">Microsoft Azure<\/a>&nbsp;is a very powerful cloud computing service created by Microsoft for building, testing, deploying, and managing applications and services through a global network of Microsoft-managed data centres. Microsoft initially released Azure in 2010, and since has&nbsp;grown massively&nbsp;and is continuing to grow and change every single day.<\/p><h3>1. Generating a Certificate Signing Request (CSR)<\/h3><p>The nature in which Azure is build on (a cloud service), means that the&nbsp;CSR and private key cannot be generated on the&nbsp;<a href=\"http:\/\/www.chriswatterston.com\/blog\/my-there-is-no-cloud-sticker\" title=\"\">&ldquo;cloud&rdquo; server<\/a>. Instead, we need to use our own physical, or&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Virtual_machine\" title=\"\">virtual&nbsp;machine<\/a>. I&rsquo;m a daily Mac user, so like to use a &lsquo;Windows 10&rsquo; virtual machine to perform this type of task.\n\nOpen the Windows application&nbsp;<a href=\"https:\/\/www.iis.net\/\" title=\"\">Internet Information Services (IIS)<\/a>&nbsp;and select &lsquo;Server Certificates&rsquo; within the root &lsquo;Connections&rsquo; tree list. Over on the right within the &lsquo;Actions&rsquo; panel, select &lsquo;Create Certificate Request&rsquo; - continue following the onscreen instructions until you have saved and opened up your TXT file in front of you.<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/5615\/1150\/9770\/tut-createpfx-step1.jpg]<\/p><h3>2. Submitting CSR to a Certificate&nbsp;Authority&nbsp;(CA)<\/h3><p>Once you have&nbsp;<a href=\"https:\/\/uk.godaddy.com\/web-security\/ssl-certificate\" title=\"\">purchased an SSL certificate for you preferred CA<\/a>, you&rsquo;ll be required to submit your CSR into their system. Every CA will have a slightly different process to follow, but it should be faily simple...\n\nNow that you&rsquo;ve submitted your CSR, you will likely be required to complete some kind of &lsquo;Domain Access Verification&rsquo;. This is normaly achieved by adding a TXT record into the domain&rsquo;s DNS, in which you are purchasing and applying the SSL against.\n\n<strong>BUT I want to create a PFX for an existing SSL certificate<\/strong>&nbsp;- That&rsquo;s cool. Instead of buying a new SSL, you&#039;ll just need to &lsquo;Rekey&rsquo; your existing certificate. You can do this by re-submitting a new CSR to the CA. Every CA have different methods, but it should still a simple process.<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/7115\/1143\/9383\/tut-import-step2.jpg]<\/p><h3>3. Downloading and Importing Certificate<\/h3><p>Now that you have successfully completed all the domain verification processes, you will now be able to download your certificate files. Some CA&#039;s allow you to do this in a number of different formats (Exchange, Apache, ISS, etx). It&rsquo;s normally good practice to download the files for the method you used to create the CSR, therefor I will be downloading the files for IIS.\n\nAfter downloading, extract the ZIPPED files onto your Desktop. Back within IIS, under the &lsquo;Actions&rsquo; panel as before, select &lsquo;Complete Certificate Request&rsquo;. Located and select the certificate file (.crt) which you download within the ZIPPED file, enter a recognisable and friendly name and click &lsquo;Ok&rsquo;.<\/p><h3>4. Exporting PFX ready for Azure<\/h3><p>You should now be able to see your imported certificate within the IIS &lsquo;Server Certificates&rsquo; list. Let&rsquo;s move onto exporting the all important and required PFX file for Azure.\n\nOpen up console by typing &lsquo;mmc&rsquo; into &lsquo;Run&rsquo; (Windows + R). Within the console, click &lsquo;File&rsquo; and &lsquo;Add\/Remove Snap-ins&hellip;&rsquo;.&nbsp; Select and add &lsquo;Certificates&rsquo;, choosing to manage for &lsquo;Computer Accounts&rsquo; during the process.\n\nAfter loading the &lsquo;Certificates&rsquo; Snap-in, within the console tree list, expand &lsquo;Certificates &gt; Personal &gt; Certificates&rsquo;. You should now see your certificate listed. Right Click the certificate, and Select &lsquo;All Tasks &gt; Export&hellip;&rsquo;. During the process, make sure that you select &lsquo;Yes&rsquo; when asked to export the private key and that the following options are selected - ensure that the option &lsquo;Delete the private key if the export is successful&rsquo; is UNSELECTED ...otherwise this whole process is a waste of time :)\n\n<strong>NOTE:<\/strong>&nbsp;During the process, ensure that you give your exported PFX a strong password. But remember to write it down as you&rsquo;ll need to when you import into Azure.<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/3115\/1143\/9389\/tut-export-step3.jpg]<\/p><h3>5. Importing PFX into Azure<\/h3><p>Congratulation! Now that you have your PFX file ready and waiting, we can now&nbsp;import straight into Azure.<\/p><p><a href=\"https:\/\/portal.azure.com\/\" title=\"\">Sign into your Azure account<\/a>, select the App you wish to apply the SSL against and open &lsquo;SSL Certificates&rsquo;. Select &lsquo;Upload Certificate&rsquo; and browse for the PFX (.pfx) file you created, making sure you enter&nbsp;your strong password&nbsp;- and finally finish by clicking &lsquo;Upload&rsquo;.<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/3515\/1143\/9387\/tut-pass-step5.jpg]<\/p><p>You can now continue to add SSL Binding to your web app, or apps&nbsp;if you have a wildcard, to enable your site to use the certificate and load as HTTPS - well done :)<\/p>"},{"articleLiveDate":"2017-11-16T23:00:00Z","articleUpdateDate":null,"articleTitle":"A brief breakdown of GDPR, as outlined by the ICO","articleUrlSlug":"brief-breakdown-gdpr-ico","articleDescription":"It can be overwhelming when new laws and regulations are introduced. So for you, I've taken everything the ICO outlined, and reduce it into a crash course","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2><strong>It can be quite overwhelming when new laws and regulations are introduced, so for you, I&rsquo;m going to take everything the ICO have said and reduce it into a type of simplified &ldquo;crash course&rdquo;. This will hopefully enable others to quickly and effectively understand and take in what needs to be understood. So without further ado, let&rsquo;s dive straight in.<\/strong><\/h2><h3>What is the GDPR?<\/h3><p>GDPR, in full stands for&nbsp;<a href=\"https:\/\/ico.org.uk\/for-organisations\/data-protection-reform\/overview-of-the-gdpr\/\" title=\"\">General Data Protection Regulation<\/a>, which is a new legal framework that is being enforced within the&nbsp;<a href=\"https:\/\/europa.eu\/european-union\/index_en\" title=\"\">European Union<\/a>&nbsp;(EU) and is replacing the current&nbsp;<a href=\"https:\/\/ico.org.uk\/for-organisations\/guide-to-data-protection\/\" title=\"\">Data Protection Act 1998<\/a>&nbsp;(DPA). The GDPR has similarities with the existing DPA, but has a number of new and amended requirements.<\/p><h3>Why the GDPR?<\/h3><p>GDPR has been introduced to provide a law for data protection, for everyone. It&rsquo;s been introduced to provide individuals with rights over their data because having a&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Safeguard\" title=\"\">safeguarded<\/a>&nbsp;system in place is more important than ever, given the growing&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Digital_economy\" title=\"\">digital economy<\/a>.<\/p><h3>When is the deadline?<\/h3><p>GDPR for the UK will go into force from 25th&nbsp;May, 2018. It&rsquo;s confirmed that the UK&rsquo;s decision to leave the EU will not affect the enforcement of the GDPR. It&rsquo;s important for organisations to prepare for GDPR ahead of this deadline.<\/p><h3>Who does the GDPR apply to?<\/h3><p>GDPR applies to all personal data &rsquo;controllers&rsquo; and&nbsp;&lsquo;processors&rsquo; of organisations operating within the EU, and worldwide organisations outside the EU that offer goods or services to individuals within the EU.<\/p><p><em>&lsquo;<\/em><strong><em>controller<\/em><\/strong><em>&rsquo; is the natural or legal person, public authority, agency or other body which, alone or jointly with others, determines the purposes and means of the processing of personal data; where the purposes and means of such processing are determined by Union or Member State law, the controller or the specific criteria for its nomination may be provided for by Union or Member State law.\n\n&lsquo;<\/em><strong><em>processor<\/em><\/strong><em>&rsquo; means a natural or legal person, public authority, agency or other body which processes personal data on behalf of the controller.<\/em><\/p><p>For example, if &lsquo;Your Co.&rsquo; sells clothing to shoppers and uses &lsquo;eMarketing Co.&rsquo; to send emails to customers on your behalf, which also tracks their email engagement, then in relation to such email data, &lsquo;Your Co.&rsquo; is the controller, and &lsquo;eMarketing Co.&rsquo; is the processor.<\/p><p>Organisations must now be responsible for obtaining and keeping a thorough record of how and when an individual gives legitimate consent to store and use their personal data. Consent now means active agreement.<\/p><p>For example, consent can no longer be obtained by a pre-ticked box. Organisations that control how and why data is processed will have to show a clear audit trail of consent provided by the individual. This may include screen shots\/grabs or stored consent forms.<\/p><h3>Who can ignore the GDPR?&nbsp;<\/h3><p>GDPR does not apply to certain activities including processing covered by the&nbsp;Law Enforcement Directive, processing for national security purposes and processing carried out by individuals purely for personal\/household activities.<\/p><p>So yes, you don&rsquo;t have to permanently delete all your friends contact details from your phone.<\/p><h3>What data does GDPR apply to?&nbsp;<\/h3><ul><li><p><strong>Personal Data<\/strong>\nThis means data which relate to a living individual who can be identified; (a) from those data, or (b) from those data and other information which is in the possession of, or is likely to come into the possession of, the data controller, and includes any expression of opinion about the individual and any indication of the intentions of the data controller or any other person in respect of the individual.\n\nFor example, names, home addresses, medical details, banking details and email addresses.<\/p><\/li><li><p><strong>Sensitive Personal Data<\/strong>\nThis means personal data consisting of information as to; (a) the racial or ethnic origin of the data subject, (b) his political opinions, (c) his religious beliefs or other beliefs of a similar nature, (d) whether he is a member of a trade union, (e) his physical or mental health or condition, (f) his sexual life, (g) the commission or alleged commission by him of any offence, or (h) any proceedings for any offence committed or alleged to have been committed by him, the disposal of such proceedings or the sentence of any court in such proceedings.<\/p><\/li><\/ul><p>Personal data is used in everything from online sales and customer relationship management, through to marketing - ouch!<\/p><h3>Other fun facts about GDPR?<\/h3><ul><li><p>There is now a legal right over personal data that is held by organisations. This means you can ask an organisation to permanently delete everything about yourself, or even ask for a human readable copy if you really wanted to. Remember those nuisance sales calls (PPI, recent car accidents), you&rsquo;ll now be able to ask them to completely delete your personal data from their system and they will have to comply by law - finally!<\/p><\/li><li><p>Almost all organisation will need to re-write their terms and conditions, privacy, and\/or contracts, etc. This means you&rsquo;ll likely have to re-read a few new documents for every organisation you have relation to.<\/p><\/li><li><p>Organisations should only collect the data that is actually needed to provide the intended goods or services. For example, Spotify should not be asking the gender of a user signing up, unless they have a valid and good reason for it, and you have legally agreed to hand over those details.<\/p><\/li><li><p>GDPR will still be enforced and made law even though the UK are leaving the EU.<\/p><\/li><li><p>For organisation that provide a service, or operate, within the EU and collect personal data, will need to provide a method of exporting your personal data in a human readable format, portability. For example, Spotify will need to enable you to export your playlists in a human readable format, this is very powerful!<\/p><\/li><li><p>Organisations that do not provide methods of gaining your personal data yourself, will therefor need to manually provide this data for you on request. These organisations will need to provide you with your personal data within 30 days of request, and will not be able to charge for this action.<\/p><\/li><li><p>In the event of a data breach, the maximum fine is &euro;20 million or 4% of an organisations annual global turnover - whichever is greater. These fines apply to all sectors (private, public, charities and individuals).<\/p><\/li><li><p>If a fine has been given for data breach, the fine that is applied to a &lsquo;controller&rsquo; or &lsquo;processor&rsquo; is dependent on how involved they were in the breach.<\/p><\/li><li><p>In the event of a data breach against an organisations in which personal data has been leaded, you have legally 72 hours to notify the ICO if you are impacted. Whether or not you need to notify a personnel such as customers or the general public, will depends on the level of impact in which the leaked data is believed to cause.<\/p><\/li><li><p>Organisation that enable encryption on personal data does not mean that certain areas of DGPR are solved. The data is still present and effectively accessible - it can still be accessed, it might just look different and take a lot longer for an intruder to decrypt.<\/p><\/li><li><p>It&rsquo;s been reported that the ability to prove valid consent for using personal information is likely to be one of the biggest challenges presented by the GDPR for organisations to comply with.<\/p><\/li><li><p>Organisations need to ensure that the use of simple language when asking for&nbsp;consent to collect personal data. An organisations needs to be clear about how the information will be used, and need to understand that silence or inactivity no longer constitutes consent.<\/p><\/li><li><p>It&rsquo;s now more important than ever for organisations to outline exactly what personal data they are collecting and how it will be processed and used. Without valid consent, any personal data processing activities will be shut down by ICO, or any related authorities.<\/p><\/li><li><p>GDPR not only applies to new personal data collected, but also all&nbsp;existing&nbsp;data that organisations hold. For example, If an organisations marketing subscription database includes data that was collected in a way that doesn&rsquo;t comply to the GDPR&rsquo;s standards, or if you can&rsquo;t provide sufficient proof of consent, you might not be allowed to send any more marketing material to those subscribers from the deadline.<\/p><\/li><li><p>GDPR not only applies to the personal data stored in digital formats, but also the data stored on paper and placed within an organisations filing cabinet. It&rsquo;s also important to remember that personal data is also stored on public and private CCTV systems - but thats another debate altogether.<\/p><\/li><li><p>Organisations can no longer have an automatic opt-in within terms and conditions, forms, or contracts. This means that just because you have been emailing Joe Blogs form an organisation, they should not be automatically adding you to their marketing lists, or officially and intentionally saving your details on their marketing system - unless you have legitimately and clearly given the organisation to do so.<\/p><\/li><\/ul><h3>How to comply with the GDPR?&nbsp;<\/h3><p>As mentioned, organisation that do not comply with the new GDPR&rsquo;s standard&#039;s, rack up the possibility that that organisation could be fined. Whether your organisation is a school, college, nursery, limited company, self-employed individual, you still need to comply. Let&rsquo;s list some tips on how you can do this.&nbsp;<\/p><ul><li><p><strong>Awareness -<\/strong><\/p><p>Make people related to your organisation aware that the DPA is changing and how it will affect areas. This doesn&rsquo;t need to be a long and boring process, just outline the important bits and why this is happening.<\/p><\/li><li><p><strong>Information -<\/strong><\/p><p>Find and audit the information you currently hold and what data processing policies are currently in place and publicly available. It&rsquo;s likely they will need to be updated. Remember, you should only be processing the data that your really need.<\/p><\/li><li><p><strong>Privacy -<\/strong><\/p><p>Review your current privacy agreement for your organisation and put a plan in place for any changes that are required, or necessary. Again, it&rsquo;s likely they will need to be updated.<\/p><\/li><li><p><strong>Rights -<\/strong><\/p><p>Check your organisation&rsquo;s current privacy policies to ensure your processes cover all the rights individuals have with the new DGPR. This should include areas such as, how they can request to permanently delete their personal data, and also that they can request a copy of all their personal data that you hold.<\/p><\/li><li><p><strong>Consent -<\/strong><\/p><p>Review how your organisation is seeking, obtaining and recording consent for data processing. Remember the process needs to be clear to the individual who is providing their personal data.<\/p><\/li><li><p><strong>Breaches -<\/strong><\/p><p>Make sure you have the correct procedures in place to investigate and report a data breach. This means having someone dedicated within your organisation that will process and notify the ICO within 72 hours.<\/p><\/li><li><p><strong>Students -<\/strong><\/p><p>Think about what systems you&#039;re going to put in place to verify the age of potential admission and on-role students, and to gather consent from parents or guardians in regards to data processing.<\/p><\/li><li><p><strong>Employees -<\/strong><\/p><p>Similar to that of the above &#039;Students&rsquo;, think about the system and process you are going to put in place to obtain employee data. Remember that you should only be processing the data that is actually needed.<\/p><\/li><li><p><strong>Officers -<\/strong><\/p><p>Similar to &lsquo;Breaches&rsquo;, it&rsquo;s recommended to designate a Data Protection Officer within your organisation to take responsibility for data protection compliance. This way it shouldn&rsquo;t get forgotten about and can be organised and kept current.<\/p><\/li><li><p><strong>e-Safety -<\/strong><\/p><p>Having an e-safety policy in place is vital to ensure all key stakeholders know what needs to be done to remain compliant. Schools should already have one in place for safeguarding reasons, it&rsquo;s likely this will also need to be updated.<\/p><\/li><li><p><strong>Processor -<\/strong><\/p><p>Choose an accredited Data Processor who is also compliant with GDPR obligations and IT asset disposal. Maybe this is undertaken in-house or by a third-party. Who ever you choose, are they compliant, do you trust them and are they staying current?<\/p><\/li><li><p><strong>Controller -<\/strong><\/p><p>Remember, your organisation is the &lsquo;controller&#039; of stored personal data used for your organisation. Whether you are the &lsquo;processor&rsquo;, or using a third-party, you still need to ensure your organisation comply with the new GDPR&rsquo;s standards before the deadline.<\/p><\/li><\/ul><p>I can understand that the fast approaching GDPR enforcement can seem overwhelming and scary, but one you understand it, it&rsquo;s really not that bad. It&rsquo;s here to stay so we just need to comply, get used to it and make it day-to-day procedures. It doesn&rsquo;t matter if your organisation doesn&rsquo;t benefit for these new laws, it&rsquo;s being put into force for you as an individual person\/human being, to protect you and give you rights against your personal data.<\/p><p>For as long as the ICO care, if your organisation has clear, ligament, proper and recorded consent for all data processing - then you&rsquo;ll be just fine :)<\/p>"},{"articleLiveDate":"2017-11-11T23:00:00Z","articleUpdateDate":null,"articleTitle":"The not so \"shocking\" costs for your web solutions","articleUrlSlug":"cost-of-web-design-solutions","articleDescription":"For years, I've witnessed so many leads that enter a state of shock by the costs of design, web and development services. But why?","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2><strong>For years I&#039;ve witnessed many that seem to enter a state of shock by the proposed costs of design and development services, and to this day I&#039;m still questioning why? Maybe it&#039;s because of these try to Do It Yourself (DIY) online services that are popping up all over the place that cost just a few quid a month. Or maybe it&#039;s just that they think the solution being provided is a piece of cake and doesn&#039;t require any technical thinking or skill. It&#039;s not like we are providing a unique professional solution built from the ground up that can assist in your success, right?<\/strong><\/h2><p>I am an independent provider of bespoke solutions. Solutions involving design and code aspects for web and mobile. I quote &ldquo;bespoke&rdquo; with pride and passion, because I&rsquo;ve seen many providers lately claiming to provide bespoke solutions - which you can see within their portfolio of work they clearly use templates. As you can imagine, this is very frustrating for myself and other similar folk. With that aside, let&rsquo;s get back on subject by jumping straight off and put things into perspective.<\/p><h3><strong>Average Salary<\/strong><\/h3><p>The reported average salary in the United Kingdom is &pound;37,000. That&#039;s &pound;3,083.33 per month or &pound;770.75 per week before any taxes have been deducted. Give 20% of that to the&nbsp;<em>much loved<\/em>&nbsp;Tax man and another chunk for National Insurance (NI), and you&#039;re going home with around &pound;28,327.20 in your back pocket.<\/p><p>With that in mind, the average quality bespoke website design and development solution&nbsp;<em>can<\/em>&nbsp;take around 2 to 8 (+\/-) months to complete, that&#039;s from first client introduction through to the big public launch. That&#039;s 8+ weeks or around 40 working days. That works out, using the average salary, we&rsquo;d expect the solution to cost between &pound;6,166.66 and &pound;9,249.99. But get this&hellip; *queue drum roll* a massive percentage of&nbsp;<a href=\"http:\/\/www.chriswatterston.com\/designer-developer-solutions-and-services\" title=\"\">designer and developers<\/a>&nbsp;do you a favour and WON&rsquo;T price projects on how long they take, but on a per project bases instead - which you&rsquo;ll benefit from hugely!<\/p><h3><strong>Costing Methods<\/strong><\/h3><p>During the pricing of a project, there are multiple areas on which effects the project costs. For example, maybe you need something to&nbsp;<a href=\"http:\/\/www.chriswatterston.com\/design-development-solutions-and-services\/shopify-ecommerce-website-designer-solution\" title=\"\">sell online with, such as an eCommerce<\/a>. Or maybe you&#039;re an&nbsp;<a href=\"http:\/\/www.chriswatterston.com\/designer-developer-solutions-and-services\/bespoke-website-designer-solution\" title=\"\">innovative startup that requires an &lsquo;all singing and dancing&rsquo; solution<\/a>. At the end of the day, everything from the purpose; quality, time frame and features, will all have an impact on the costs for the solution being provided.<\/p><p>As an attempt to shed some light, I want to try to making it clearer on why design and development solutions shouldn&#039;t shock clients, but instead reassure them. Let&rsquo;s briefly go over the questions that projects are commonly priced on;<\/p><h4>Solve the Problem<\/h4><p>What is the problem that needs to be solved because for every problem, there is a solution. This is what solutions and services are based around. If there were no problems, there would be no need for solutions - simple.<\/p><h4>Features &amp; Functionality<\/h4><p>There is never a list of features or functionality set in stone. The needs and requirements are likely to change with every project, which is why 99.9% of projects are tailored to solve your problem. It doesn&rsquo;t matter if it&rsquo;s the source code for an iOS App or just raw design files, the chances of your project being exactly the same as another i&rsquo;ve just completed is very slim.<\/p><h4>Deadline or Time frame<\/h4><p>If you require your solution to be in place by a specific date, it&rsquo;s going to have an impact on costs. For example; you need an eCommerce solution designed, developed and launched before next Friday, then I&rsquo;ve got a challenge on my hands. I won&rsquo;t be sleeping for a week, and that&rsquo;s going to take a heavy impact on overall costs (as well as my heath).<\/p><h4>Quality &amp; Care<\/h4><p>I try to avoid repeating myself to everyone, but it&rsquo;s true. I&rsquo;ll also live by the phrase - &ldquo;quality over quantity&rdquo;, which is what I carry thought into all the solutions I provide. Would you rather pay for something that you know is going to work well and effectively, or would you prefer to pay quarter of the costs but be back at square one in 12 months time? Buy less, choose well.<\/p><h4>After Sales&nbsp;Support<\/h4><p>The continuation of support and advice after implementation of a solution can&nbsp;<em>sometimes<\/em>&nbsp;not be required, but will be appreciated. What if a minor tweak needed to be made three weeks or four months after implementation, that&rsquo;s when the after sales continuation truly matters and stands proud.<\/p><p>Is that what you expected to be accountable with the overall costings? Maybe, maybe not - but everything in life has a value, whether this is for the manufacturing or labour, it still holds value.<\/p><h3><strong>Conclusion of Costs<\/strong><\/h3><blockquote><p>OK, so why are others offering websites for &pound;395?<\/p><\/blockquote><p>This is the type of question I&rsquo;ve been asked more often than I should of. My answer always highlights that even a bespoke designed website towards the lower end of the scale can average from &pound;1,000+ - without questioning!<\/p><p>Ask yourself what the costs of buying a car today would be? You&rsquo;ll hesitate because there is no straight answer. Questions like this open up the flood gates to many more questions like; what make, model, body type, colour, engine size, fuel type, number of doors, new or used, mileage and all the other extras available. What about the cost of your time to source the car, order the car with a possible waiting list, or maybe even reach out to a broker. Then after you do finally get your hands on a car, you&rsquo;re going to need to run it - fuel costs, road tax, regular services, MOT tests, insurances and finally maintaining your car&hellip; yes *and breath*!<\/p><p>When it comes to any unique and bespoke solution, it comes down to one simple fact, you&rsquo;re receiving a professional, detailed and time \/ labour involved solution. It&rsquo;s certainly NOT a replicated and automated robot process like a &pound;395 website. You&rsquo;re a client we truly car about, not a number. Maybe look at it from another angle, you&#039;d like a brand new bespoke built-in wardrobe for your bedroom, both deigned and fitted - you can see where this is going.<\/p><p>Bespoke design services need to be discussed, understood, analysed, planned and THEN priced through a formal project proposal and quotation with all the above in mind. If you&rsquo;re reaching to an actual person to provide you with a design and development solution, then just remember you will be receiving a one-to-one bespoke service, to resolve your problem with their solution - so please, please expect costs for that particular solution to be of real life value. Not costs like a &pound;395 automated service. If not, then you&rsquo;re likely looking for the wrong solution and shouldn&rsquo;t waste anybody else time.<\/p>"},{"articleLiveDate":"2017-10-29T23:00:00Z","articleUpdateDate":null,"articleTitle":"SKOOLping progress and why the delay?","articleUrlSlug":"skoolping-app-progress-delay","articleDescription":"Two steps forward, one step back. It seems with all startups there are hurdles to jump through and bridges to climb, with every step of progress","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2><strong>Two steps forward, one step back. It seems with all startups there are hurdles to jump through and bridges to climb, with every step of progress. It just happens that the brand I have come to create for our communication app includes a particular four letter word, &ldquo;ping&rdquo; - which made things a little more challenging.<\/strong><\/h2><p>I submitted the&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Trademark\" title=\"\">trademark application<\/a>&nbsp;for SKOOLping back in January 2017, but unluckily received an opposition letter in March 2017 against the application. Acknowledging this opposition, all design and development work for SKOOLping was put on hold until further notice. The opposition received was sent on behalf of&nbsp;<a href=\"https:\/\/www.google.co.uk\/search?q=Karsten+Manufacturing+Corporation&oq=Karsten+Manufacturing+Corporation\" title=\"\">Karsten Manufacturing Corporation<\/a>, holder of the well-known worldwide trademark PING. The representative of the letter clearly highlighted that the PING trademark is an extremely well-known brand of golfing equipment, with the registered trademark widely around the world. The letter also specifically included a copy of the oppositions EU Trade Mark Registration, which covered further broad terms and details.<\/p><p>Fast-forward a number of months and the sending of many emails to specialised trademark lawyers and associates, myself and Karsten Manufacturing Corporation came to a trusted, fair and workable agreement. Our contract of agreement, thankfully enabled SKOOLping to continue without withdrawing the trademark application. But quite rightly, Karsten did requested that I submit a form TM21B to the IPO, requesting to amend the trademarks actable classes and terms. The change myself and Karsten agreed upon, included the update of &lsquo;Class 9&rsquo; to clearly quote the following; &ldquo;Software application enabling communication methods between an&nbsp;education provider and parents and\/or guardians.&rdquo;<\/p><h2><strong>Your Understanding<\/strong><\/h2><p>I truly hoped to launch the Beta of SKOOLping in April 2017, but due to the outlined reason, progress has been hugely delayed. But these unfortunate things do happen and we have to work through them. Yes it has undeniably slowed the overall progress of my vision to a halt, but it has also allowed my passion for this project to build up momentum inside. Including the thought of some exciting new ideas! The skies have cleared again for now and I can now continue to progress with SKOOLping.<\/p><p><strong>I can&rsquo;t thank you enough for your patience - to the future :)<\/strong><\/p>"},{"articleLiveDate":"2017-10-03T23:00:00Z","articleUpdateDate":"2022-08-26T23:27:00Z","articleTitle":"Aerial footage of Rothesay on the Isle of Bute, Scotland","articleUrlSlug":"aerial-film-isle-bute-scotland","articleDescription":"In mid August, we had a short break to visit a small town in sunny Scotland were my father grew up, Rothesay on the Isle of Bute","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2>In mid August, we had a short break to visit a small town in sunny Scotland were my father grew up, Rothesay on the Isle of Bute. Some will know that Scotland has a never ending supply of lines and curves that rum all over it&rsquo;s body, it&rsquo;s a place of natural beauty that never fails to take your breath away - yes we&rsquo;re still taking about Scotland!<\/h2><p>The footage and photos I took during this short break in&nbsp;<a href=\"http:\/\/www.visitbute.com\/\" title=\"\">Rothesay, Bute,<\/a>&nbsp;unfortunately doesn&rsquo;t gives this place any justice. If you&rsquo;ve visited Scotland, you&rsquo;ll understand why I say that. But if you haven&rsquo;t, then I think you should make it one of your priorities to do so next year. But make sure you take clothes for all seasons.<\/p><p>The footage I captured during our break, between the short and unexpected showers, were achieved with &ldquo;the sexiest drone that DJI ever designed&ldquo;, the&nbsp;<a href=\"https:\/\/www.dji.com\/phantom-4\" title=\"\">DJI Phantom 4<\/a>. This was my first attempt in creating a trailer for anything, let alone a trailer of our short break. Yeh I could of improved it a lot and admittedly missed some opportunities to capture some unique footage, but this is how we learn. I look forward to creating something similar in the future.<\/p><p>[youtube-start:qO4qxzYKUqo:youtube-end]<\/p>"},{"articleLiveDate":"2017-09-27T23:00:00Z","articleUpdateDate":null,"articleTitle":"Building a Kids Hobbit Adventure Play House for our Kids","articleUrlSlug":"hobbit-adventure-play-house","articleDescription":"As our daughters are growing up, we wanted a sheltered place for them to play in and escape from us, their parents. Possibly a pretty pink Wendy playhouse?","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2>As our daughters are growing up, we wanted a sheltered place for them to play in and escape from us, their parents. Possibly a pretty pink Wendy playhouse? Being a creative and DIY &ldquo;hands on&rdquo; kind of guy, I&rsquo;d be building something unique from the ground up - I didn&rsquo;t build a Wendy playhouse, I went all out and creating something not many kids have. I built them a Hobbit Adventure like no other.<\/h2><p>This particular personal family project begin back in October 2016, when my partner, Georgina, and I talked about buying our daughters a &ldquo;girly&rdquo; Wendy playhouse for them to play&nbsp;and store their toys in. I initially agreed and became quite fond of the idea, but having Scottish in my blood, I started to become against the idea. It was the&nbsp;idea of buying something I knew I could build. I also thought most playhouses on the market were rather boring, they were basically all very similar to one another.<\/p><p>In the end, we both agreed that I&rsquo;d build our daughters a playhouse. I yearn for letting my creative juices flow while having fun - let&rsquo;s build a Hobbit Hole Playhouse!<\/p><p>Around September 2016, the build started. The structure would have to withstand earth being placed on top, people walking over it and damp surroundings. Because I planned on building an REAL miniature &ldquo;semi-under ground&rdquo; Hobbit Hole. Not a Hobbit styled garden shed.<\/p><h3>Let&#039;s build<\/h3><p>[http:\/\/www.chriswatterston.com\/application\/files\/7315\/0659\/4515\/hobbit-hole-playhouse-01.jpg]<\/p><p>I used an old 7&rsquo;ish metre 10mm RSJ steel beam for the main structural framework, this was perfect as it was strong, durable and workable. Cutting this down the middle then created 2 equal T-section steel lengths, to then be aligned and welded together to create 2 trapezoid shaped frames. I then used another smaller 10mm RSJ steel beam to fix between the top sections of the trapezoids. I then strapped the frame up and lifted into were we wanted it, allowing me to mark on the grass which area would be excavated and how deep.&nbsp;<\/p><p>Once we were happy with the placement and depth, I moved the structure to start excavation a large hole 600mm deep. I also installed a number of 8&rdquo;x2&rdquo; treated wooden lengths to the structure, enabling an easy base for when I start constructing the walls. After I was happy with the framework and structure knowing it was strong enough and safe enough, I moved onto the interior.<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/8015\/0659\/4512\/hobbit-hole-playhouse-02.jpg]<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/1415\/0659\/4510\/hobbit-hole-playhouse-03.jpg]<\/p><p>Naturally, being a Hobbit Hole the interior needed to look and feel natural. I nipped to Wickes to pick up some Plywood and made a start on the interior. The sides and rear walls of the Hobbit Hole would be be covered in earth, so these were fitted inside and outside with 18mm chipboard. The front side wouldn&rsquo;t have any earth weight against it, so 9mm Plywood was used. The roofs exterior, like the sides and rear, had 18mm chipboard. For the roofs interior, I decided to make this a lighting feature and create a &lsquo;Star Ceiling&rsquo; effect. Instead of using a traditional optic fibre lighting system to create the desired effect, instead I used the cheaper and tougher option of white LED Christmas lights. I first intended to have the stars scattered, but due to the structure and limitation of the lights and avoiding the wastage of valuable light, since it was going to be quite&nbsp;a dark space, I decided to lay them out in a &lsquo;zig-zag&rsquo; and use every available bulb. After approval from our eldest daughter, Ellie, I continued to mark every lights placement with a black dot and drilled a 4mm hole through the Plywood to home the lights, finally fixing with a glue gun.&nbsp;<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/1615\/0659\/4516\/hobbit-hole-playhouse-04.jpg]<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/1215\/0659\/4513\/hobbit-hole-playhouse-05.jpg]<\/p><p>Now that the &lsquo;Star Ceiling&rsquo; was built, tested and installed, it was time to lift the Hobbit Hole one last time and drop it into its final resting place.<\/p><p>The hole was lined with 1mm plastic as damp proofing, with the structure then placed inside of that, I continued to wrap the whole structure in the same plastic, excluding the front wall. I then used sections from an old chopped up glass fibre pond to help add extra strength and seal the top. Sealing the floor, I used concrete. Thankfully, when it came to filling the base and exteriors outer edges with roughly 200mm of concrete, we had my partners nephew, George, staying who saved a lot of heat, sweat and red faces - good man!&nbsp;<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/9015\/0659\/4520\/hobbit-hole-playhouse-07.jpg]<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/5215\/0659\/4521\/hobbit-hole-playhouse-08.jpg]<\/p><p>While the concrete we laid it in the morning was left to set and harden, during the afternoon, George and I decided to dig and run armoured cable into the Hobbit Hole. Throughout the week, I moved onto building and installing a Hobbit style door, sealed the exposed Plywood with liquid damp proofing and finally started to pile earth around the rear and sides. To control the lighting and ensure there were no exposed switches for the children, I tucked all the electrical components and connections away in a secure wall box, fitted with a&nbsp;<a href=\"https:\/\/www.lightwaverf.com\/solution\/smart-home\/\" title=\"\">LightwaveRF<\/a>&nbsp;inline relay. This meant we could control the lighting by remote or through our smartphones.<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/2315\/0659\/4523\/hobbit-hole-playhouse-09.jpg]<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/3015\/0659\/4525\/hobbit-hole-playhouse-10.jpg]<\/p><p>Moving on, now that the concrete had set and safe enough to climb inside, it was time to decorate and create a feature wall. I decided on creating a feature wall which involved log slices, so I set-up the cradle and fired the McCulloch chainsaw into life. Cutting each slice of already seasoned wood at approximately the same thickness. In total,&nbsp;cut roughly 2 large buckets to have enough to completely cover the rear wall.&nbsp;<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/4615\/0659\/4526\/hobbit-hole-playhouse-11.jpg]<\/p><p>Before the slices were placed onto the wall, I ensured any dust was brushed off. I got myself 3 tubes of &#039;Sticks Like&#039;&nbsp;shit&nbsp;and started slapping them onto the rear wall in a random like pattern. I continued through and finished the feature wall, as well as covering the external liquid damp proofing with artificial grass, and found an old vintage light to hang outside the front which I filled with the remaining &#039;Star Ceiling&rsquo; LED lights. I was very VERY happy with how this turned out and how the whole thing was looking, admittedly, I was defiantly more excited at this point than our daughters were.<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/1615\/0659\/4528\/hobbit-hole-playhouse-12.jpg]<\/p><p>The Interior was now complete and working, it was damp proofed and grass was slowly but surely starting to growing on the roof and up the sides. Things were working out great! I now needed to cover the exposed blue plastic wrap around the front, doing so with an old corrugated roofing sheet. Cut to size and overlapped, secured with concrete, expandable foam and pop rivets - and finally finished off with a lick of brown paint to help blend in and look natural. I also created 2 log retaining walls to help hold back the earth, held together by large pins that are put through every log and then into the ground.<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/2315\/0659\/4529\/hobbit-hole-playhouse-13.jpg]<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/3815\/0659\/4531\/hobbit-hole-playhouse-14.jpg]<\/p><h3>Thoughts on the final outcome<\/h3><p>Fast forward over 6 months, I&rsquo;m happy with how things look and worked out. This wasn&rsquo;t a step-by-step planned projects, it was merely a &quot;make it up as you go along&quot; kind of project with no deadlines, which was nice. Projects like this give you the opportunity to chop and change ideas as you go, but can also allow you to forget to do things that you should of done - but lucky for me I hadn&rsquo;t&hellip; I think?<\/p><p>The grass hasn&rsquo;t fully grown yet and is still a tad patchy, but it will grow in time. My partner has recently planted strawberries and scattered coloured wild flower seeds, so next year things should look even better. This is the type of project that looks better and more natural as time goes on, when nature tries to take over again. What do you think?<\/p><p>[instagram-start:BWOGnMjDMXJ:instagram-end]<\/p><p>[instagram-start:BZWVGsBDYL4:instagram-end]<\/p>"},{"articleLiveDate":"2017-06-19T23:00:00Z","articleUpdateDate":null,"articleTitle":"The missing Spotify widget for Mac OS Notification Center","articleUrlSlug":"missing-spotify-widget-mac-os","articleDescription":"Since installing the new operating system, OS X Yosemite, like many I've noticed a hell of a lot of new great features and design","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2><strong>Since installing the new operating system, OS X Yosemite, like many I&#039;ve noticed a hell of a lot of new great features and design. But, being an every day MacBook user, I&#039;m finding some pretty cool, but some also pretty annoying.<\/strong><\/h2><p>The first two that jumped out at me within a matter of minutes of using the new update were the very annoying &#039;Fetching...&#039; when selecting &#039;Open With&#039; on a chosen file, and lastly the&nbsp;<a href=\"https:\/\/twitter.com\/chriswatterston\/status\/523049982124101632\" title=\"\">&#039;Where&#039;&nbsp;data when viewing a files info<\/a>!<\/p><p>Pushing that aside, one of the new potential-injected features of the latest release, is the new&nbsp;<a href=\"http:\/\/www.apple.com\/osx\/all-features\/#notifications\" title=\"\">Notification Center<\/a>. Third-party developers have the power to throw bespoke widgets at this from all kinds of angles! With this in mind, I decided to take a screen shot of the OS X Yosemite NC, and stick together a little something that would bring a smile to my face (including many others) if the guys over at&nbsp;<a href=\"https:\/\/www.spotify.com\/\" title=\"\">Spotify<\/a>&nbsp;brought something similar to life....&nbsp;<em>hint, hint, nudge nudge.<\/em><\/p><p>IMPORTANT: Please understand and acknowledge that this application \/ widget concept is an unofficial design of the&nbsp;<a href=\"https:\/\/www.spotify.com\/\" title=\"\">Spotify<\/a>&nbsp;Widget. You cannot buy, subscribe or download&nbsp;<a href=\"https:\/\/www.spotify.com\/\" title=\"\">Spotify<\/a>&nbsp;services or products here. Brand credits to&nbsp;<a href=\"https:\/\/www.spotify.com\/\" title=\"\">Spotify USA Inc<\/a>.<\/p><p>Created by&nbsp;<a href=\"http:\/\/www.chriswatterston.com\/\" title=\"\">Chris Watterston<\/a>&nbsp;just for fun and an idea I would love to see come to life.<\/p><p><strong>Enjoy, and don&#039;t forget to&nbsp;<\/strong><a href=\"mailto:hello@chriswatterston.com\" title=\"\">let me know what you think<\/a><strong>?<\/strong><\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/7714\/9796\/9189\/spotify-notification-center-player-concept-GIF.gif]<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/1714\/9796\/9192\/spotify-notification-center-player-concept-desc.jpg]<\/p>"},{"articleLiveDate":"2017-01-12T23:00:00Z","articleUpdateDate":null,"articleTitle":"Hellish Gelish 'nail polish' business cards","articleUrlSlug":"nail-polish-biz-card-design","articleDescription":"I designed Hellish Gelish a unique and bespoke business card, featuring a simple and typography style, complimented by a printing method of Spot 3D UV","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2><strong>Hellish Gelish is my partners own venture. I created her a unique and bespoke design for her business cards, using a simple and typography style vision complimented by a printing method called &#039;Spot 3D UV&#039;. This style of finished coating not only visually enhances the business card, but also adds texture. The raised layer of shine enabled me to make the coloured corners become lifelike.<\/strong><\/h2><p>[http:\/\/www.chriswatterston.com\/application\/files\/1615\/0600\/6713\/hellish-gelish-uvspot-business-card.jpg]<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/5015\/0600\/6714\/hellish-gelish-uvspot-business-cards.jpg]<\/p>"},{"articleLiveDate":"2016-09-22T23:00:00Z","articleUpdateDate":null,"articleTitle":"Bespoke Guinness drink coaster Gift for my partners Uncle","articleUrlSlug":"bespoke-guinness-drink-coaster","articleDescription":"Back in February, my partner, daughters and myself were invited and attended a surprise 60th birthday party of my partners great uncle, John Lucas","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2><strong>Back in February, my partner, daughters and myself were invited and attended a surprise 60th birthday party of my partners great uncle, John Lucas. In the run up until the big evening, we spent weeks &quot;humming and harring&quot; about what would make a smashingly rememberable, but satisfying gift.<\/strong><\/h2><p>My partner and I weighed up a couple of options, but what we settled on would give a bit of fun for John (and place me in my&nbsp;<a href=\"http:\/\/www.chriswatterston.com\/what-we-do\" title=\"\">essence<\/a>). We decided to take what we know John socially loves to enjoy, give it a personal twist and&nbsp;<a href=\"http:\/\/www.chriswatterston.com\/designer-developer-solutions-and-services\" title=\"\">print<\/a>&nbsp;it onto 94mm square 1.2mm uncoated beer mats.<\/p><p>Sometimes that perfect gift can&#039;t be picked from a&nbsp;shelf, bit it will never be 110% unique and &quot;made&quot; for that person. It takes a careful&nbsp;thought process, knowing them personally&nbsp;and&nbsp;understanding what they love to enjoy and how they&#039;ll use the gift. We&nbsp;feel it couldn&#039;t of turned out any better - bringing a smile to John every time he lifts his pint of&nbsp;<a href=\"https:\/\/www.guinness.com\/en-gb\/\" title=\"\">Guinness<\/a>.<\/p><p><strong>What do you think, leave a comment - have you seen something to inspire you?<\/strong><\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/4415\/0594\/6757\/john-lucas-60th-birthday-beermat.jpg]<\/p><p>[http:\/\/www.chriswatterston.com\/application\/files\/7015\/0594\/6756\/john-lucas-60th-birthday-beermat-pint.jpg]<\/p>"},{"articleLiveDate":"2016-01-04T23:00:00Z","articleUpdateDate":null,"articleTitle":"5 goals for 2016 - Focus, progress and experiment","articleUrlSlug":"2016-goal-setting","articleDescription":"Like every Tom, Dick and Harry, I set myself new targets and challenges at the start of every year. Do I ever achieve them, behave yourself!","articleHeroImage":{"sys":{"id":"b8GHEkuG3BNt7TaMvSh5Q","type":"Asset","revision":1,"createdAt":"2022-08-16T13:11:23.364Z","updatedAt":"2022-08-16T13:11:23.364Z","environment":{"sys":{"type":"Link","id":"master","linkType":"Environment"}},"locale":"en-GB","space":{"sys":{"type":"Link","id":"b7oivln51zxg","linkType":"Space"}}},"fields":{"title":"Chris Watterston, Default Thumbnail","description":"","file":{"fileName":"chriswatterston-default-thumb.jpg","contentType":"image\/jpeg","details":{"size":33826,"image":{"width":1440,"height":960}},"url":"\/\/images.ctfassets.net\/b7oivln51zxg\/b8GHEkuG3BNt7TaMvSh5Q\/9a3f6106225f37b8be5a7a6b4a544168\/chriswatterston-default-thumb.jpg"}}},"articleBody":"<h2><strong>Like every Tom, Dick and Harry in the land, I set myself new targets and challenges at the start of every year. Do I ever achieve them, behave yourself! It&rsquo;s so frustrating telling you that, but even more so with myself for not achieving. *sigh*<\/strong><\/h2><p>Finding the time to achieve in 2014\/15 seemed almost impossible when I look back. Supporting and spending time with my 2 beautiful girls and partner, building a loving home, paying bills, working as an independent self employed designer, marketing, paperwork, trying to socialise with friends, exercising, cycling, gardening, 6 ducks, running 2 cars, selling 1 car, restoring my old 1980&#039;s Broom Speedboat and my MK1 Fiesta XR2... bla, bla, bla. (UPDATE: and now drone \/ quadcopter flying with HD camera)<\/p><p>With that being said, these were my past targets and challenges&hellip;<\/p><h3>2014 (this was the start of my first full year self employed)<\/h3><ol><li><p>Minimise on business and personal outgoings.<\/p><\/li><li><p>Provide design and development solutions to a minimum of two charities.<\/p><\/li><li><p>Write more. Post at least one blog article per month.<\/p><\/li><li><p>Design, develop and launch completed personal projects for everyone to use and benefit.<\/p><\/li><li><p>Increase involvement within online communities. Targeting Dribbble, GitHut and Conrete5.<\/p><\/li><\/ol><p>For 2015, I never did set any out in stone. But they were to continue with the explosion of work at that current time and continue with the targets and challenges from 2014.<\/p><h3>So, how did I do?<\/h3><p>Starting was a positive, target one was a success. Too right, this was my main point. Cutting costs meant I could use these &ldquo;savings&rdquo; else where. Like marketing for example. Areas I cut or altered and made massive savings on were; server environments, domain names, everyday work and office space, cycling instead of driving when I could, and I also cut a number of online third-party services that I didn&rsquo;t really need but thought it would be nice to have. You know the ones.<\/p><p>Secondly, provide design and development solutions to at least two charities. Unfortunately this didn&rsquo;t happen. Everything was in place ready for promotion, but I was just to busy at that particular time. People would say &ldquo;make the time&rdquo;, but running my &lsquo;one-man band&rsquo; business, having a family and spending time with them and living, plus everything else. I just really couldn&rsquo;t find the time. Maybe this year?<\/p><p>Write more. Post at least one blog article per month. No comment&hellip;.<\/p><p>I&rsquo;m now pushing and going for a post a week, starting today. This will be interesting!<\/p><p>Fourth. To design, develop and launch completed personal projects for everyone to use and benefit. This had been started, but didn&rsquo;t launch. Reason, I felt it was outdated and not great.\n<em>2016&hellip; watch this space!<\/em><\/p><p>Lastly. Increase involvement within online communities. This was my lowest priority and kind of got forgotten about.<\/p><h3>Now for 2016. In no particular order and with all extra hight priority&hellip;<\/h3><ol><li><p>Learn Swift (programming language)<\/p><\/li><li><p>Launch new personal project, currently labeled &lsquo;ersttt.it&rsquo;<\/p><\/li><li><p>Develop a &ldquo;dashboard&rdquo; type area which display a number of service overview(s) I provide to clients, right through to their CMS. This means learning multiple third-party API&rsquo;s.<\/p><\/li><li><p>Invest in more advertising, in more areas, with more time. You know the score.<\/p><\/li><li><p>Blog at least once a week. This may cover; what I&rsquo;ve learnt that particular week, everyday business news, new projects I&rsquo;ve launch, personal life news, etc.<\/p><\/li><\/ol><p>And what is even more exciting, every single new target and challenge is already in motion!<\/p>"}]